In [7]:
import pandas as pd

In [8]:
df=pd.DataFrame([['a',1,500],['b',2,600],['c',3,700]])

In [9]:
df

   0  1    2
0  a  1  500
1  b  2  600
2  c  3  700

In [10]:
df=pd.DataFrame([['a',1,500],['b',2,600],['c',3,700]],columns=['name','roll','marks'])

In [11]:
df

  name  roll  marks
0    a     1    500
1    b     2    600
2    c     3    700

In [12]:
df=pd.DataFrame([['a',1,500],['b',2,600],['c',3,700]],columns=['name','roll','marks'],index=['r1','r2','r3'])

In [13]:
df

   name  roll  marks
r1    a     1    500
r2    b     2    600
r3    c     3    700

In [14]:
df=pd.DataFrame({'name':['p','q','r'],'id':[1,2,3]})

In [15]:
df

   id name
0   1    p
1   2    q
2   3    r

In [16]:
df=pd.read_csv('players.txt')

In [17]:
df

    Name   runs    Sr
0  virat  11000  90.5
1  dhoni   6000  80.5
2  rohit   8000  99.2

In [18]:
df=pd.read_csv('playerss.csv')

In [19]:
df

    Name   runs    Sr
0  virat  11000  90.5
1  dhoni   6000  80.5
2  rohit   8000  99.2